Autodesk.Revit.DB.Architecture.RailTransitionOption
The transition type of the continuous rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailTransitionOption.Simple
Simple

Autodesk.Revit.DB.Architecture.RailTransitionOption.Gooseneck
Gooseneck.

Autodesk.Revit.DB.Architecture.RailTransitionOption.None
No transition.